// let a = prompt('Введите трехзначное число IF ELSE');
// if (a.length !== 3) {
//   alert('Сказали же трехзначное!!');

// } else {
//   if (a[0] == a[1] && a[0] == a[2]) {
//     alert('Все числа равны ');
//   } else if (a[0] == a[1] || a[0] == a[2] || a[1] == a[2]) {
//     alert('Есть совпадение)');
//   } else {
//     alert('Упс ни однго совпадения =(');
//   }
// }

// // /////////////////////////////////////////////////////////

// let b = prompt('Введите трехзначное число число SWITCH')
// switch (true) {

//   case b.length !== 3:
//     alert('Сказали же трехзначное!!')
//     break;

//   case b[0] === b[1] && b[0] === b[2]:
//     alert('Все числа равны');
//     break;

//   case b[0] === b[1] || b[0] === b[2] || b[1] === b[2]:
//     alert('Есть совпадения')
//     break;

//   default:
//     alert('Упс ни однго совпадения =(');
// }

// ///////////////////////////////////////////////////////////


// let c = prompt('Введите число от 1 до 500')
// if (c >500) {
//   alert ('Переборчик сударь');
// } else if (c < 0) {
//   alert ('Недобор сэр');
// } else {
//   alert ('Получилось');
// }

///////////////// Исправляю

 let d = prompt('Введите число') 
 switch(+d) {

  case 0 :
    alert ('вы ввели число 0');
    break;

    case 1: 
    alert ('вы ввели число 1');
    break;

    case 2:
    case 3:
      alert( 'вы ввели число 2 или 3');
      break;

    default:
      alert('тут число не от 0 до 3')
        
 }

